`Структура кода

Инструкции – это синтаксические конструкции и команды, которые выполняют действия.

  alert('Привет');
alert('Мир');


 // пример
alert('Hello')

[1, 2].forEach(alert);

Если мы запустим этот код, выведется только первый alert, а затем мы получим ошибку(вам может потребоваться открыть консоль, чтобы увидеть её)!

Это потому что JavaScript не вставляет точку с запятой перед квадратными скобками[...]. И поэтому код в последнем примере выполняется, как одна инструкция.



Если мы запустим этот код, выведется только первый alert, а затем мы получим ошибку(вам может потребоваться открыть консоль, чтобы увидеть её)!

Это потому что JavaScript не вставляет точку с запятой перед квадратными скобками[...]. И поэтому код в последнем примере выполняется, как одна инструкция.


`